var questions = [
  ['Које године се одиграла Мохачка битка?', 1526],
  ['Које године је почела Стаљинградска битка?', 1942],
  ['Које године се одиграла битка на Зеленгори?', 1945],
  ['Које године се одиграла битка на битка код Сенте?', 1697],
  ['Које године се одиграла Курска битка?', 1943],
  ['Битка на Плочнику вођена је у долини Топлице, које године?', 1386],
  ['Битка код Велбужда између српске и бугарске војске одиграла се?', 1330],
  ['Битка код Русокастра одиграла се?', 1332],
  ['Битка код Скопља, између Бугарског и Византијског царства одиграла се?', 1004],
  ['Чувена Кумановска битка десила се које године?', 1912],
  ['Које године се одиграла битка за Лимнос?', 1913],
  ['Битка код Ватерлоа је била када?', 1815],
  ['Које године се одиграла битка код манастира Чокешине, звана српски Термопиљ?', 1804],
  ['Гучевска битка, прва рововска битка у историји ратовања?', 1914]



];
var correctAnswers = 0;
var question;
var answer;
var response;

function print(message) {
  document.write(message);
}

for (var i = 0; i < questions.length; i += 1) {
  question = questions[i][0];
  answer = questions[i][1];
  response = prompt(question);
  response = parseInt(response);
  if (response === answer) {
    correctAnswers += 1;
  } 
}

html = "Одговорили сте тачно на " + correctAnswers + "/14 питања."
print(html);
